app/controllers/api/v1/news_page_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Post.find(params[:id])

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Post 1"], ["description", "Hello World"], ["created_at", 2017-04-23 17:46:13 UTC], ["updated_at", 2017-04-23 17:46:13 UTC], ["user_id", 1]]
---
  def create
    @post = Post.create(post_params.merge(user: current_user))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Post 007"], ["description", "LOL"], ["updated_at", 2017-04-24 19:25:32 UTC], ["id", 2]]
---
  def update
    post = Post.find(params[:id])
    post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "upvotes".* FROM "upvotes" WHERE "upvotes"."post_id" = $1 AND "upvotes"."user_id" = $2 LIMIT $3  [["post_id", 2], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "upvotes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["user_id", 1], ["created_at", 2017-04-27 11:37:04 UTC], ["updated_at", 2017-04-27 11:37:04 UTC]]
UPDATE "posts" SET "likes" = COALESCE("likes", 0) + 1 WHERE "posts"."id" = $1  [["id", 3]]
---
  def upvote
    @post = Post.find(params[:id])

    unless @post.upvotes.find_by_user_id(current_user.id)
      @post.upvotes.new(user_id: current_user.id)

      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def disupvote
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]
---
  def destroy
    post = Post.find(params[:id])
    post.comments.delete_all