app/controllers/api/v1/news_page_controller.rb

  def disupvote
    @post = Post.find(params[:id])

    unless disupvoted_by?

      if upvoted_by?
        vote = upvoted_by?
        vote.destroy
      end

      @post.disupvotes.new(user_id: current_user.id)

      if @post.save
---
UPDATE "posts" SET "likes" = COALESCE("likes", 0) - 1 WHERE "posts"."id" = $1  [["id", 3]]