app/controllers/api/v1/news_comments_controller.rb

  def create
    post = Post.find(params[:news_page_id])
    @comment = post.comments.create(comment_params.merge(user: current_user))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Nice"], ["post_id", 12], ["created_at", 2017-04-23 18:17:38 UTC], ["updated_at", 2017-04-23 18:17:38 UTC], ["user_id", 1]]

  def destroy
    post = Post.find(params[:news_page_id])
    @comment = post.comments.find(params[:id]).destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]