app/controllers/api/v1/registration_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"