app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "mr.igor96@gmail.com"], ["LIMIT", 1]]
---
  def create
    find_by_email = User.find_by(email: params[:email])

UPDATE "users" SET "session_id" = $1, "last_seen" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_id", nil], ["last_seen", 2017-04-23 17:21:31 UTC], ["updated_at", 2017-04-23 17:21:31 UTC], ["id", 1]]
---
  def destroy
    @current_session = Session.find_by_id(params[:id])
    @current_session.user.update(session_id: nil, last_seen: Time.now.utc)