app/controllers/news_comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Hello"], ["post_id", 1], ["created_at", 2017-04-01 23:19:32 UTC], ["updated_at", 2017-04-01 23:19:32 UTC]]
---
  def create
    post = Post.find(params[:news_page_id])
    comment = post.comments.create(comment_params)