app/controllers/news_page_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    respond_with Post.find(params[:id])

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Post 1"], ["description", "Hello World"], ["created_at", 2017-03-20 19:03:05 UTC], ["updated_at", 2017-03-20 19:03:05 UTC]]
---
  def create
    post = Post.create(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def destroy
    post = Post.find(params[:id]).delete